tap "azure/functions"
tap "cjbassi/gotop"
tap "clintmod/formulas"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "isen-ng/dotnet-sdk-versions"
brew "azure-cli"
brew "bat"
brew "bitwarden-cli"
brew "cloc"
brew "gh"
brew "git"
brew "go"
brew "grex"
brew "htop"
brew "imagemagick"
brew "nvm"
brew "postgresql"
brew "ranger"
brew "speedtest-cli"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tldr"
brew "wget"
brew "azure/functions/azure-functions-core-tools@3"
brew "clintmod/formulas/macprefs"
cask "amethyst"
cask "android-platform-tools"
cask "android-studio"
cask "appcleaner"
cask "bettertouchtool"
cask "cleanmymac"
cask "cscreen"
cask "docker"
cask "dotnet-sdk"
cask "dotnet-sdk3-1-400"
cask "dotnet-sdk5-0-400"
cask "dozer"
cask "dropbox"
cask "figma"
cask "firefox"
cask "font-fira-code"
cask "google-chrome"
cask "insomnia"
cask "iterm2"
cask "microsoft-office"
cask "microsoft-teams"
cask "monitorcontrol"
cask "notion"
cask "powershell"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "raycast"
cask "rocket"
cask "slack"
cask "spotify"
cask "spotmenu"
cask "the-unarchiver"
cask "visual-studio-code"
