tap "azure/functions"
tap "cjbassi/gotop"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "isen-ng/dotnet-sdk-versions"
brew "azure-cli"
brew "bat"
brew "bitwarden-cli"
brew "cloc"
brew "gh"
brew "git"
brew "go"
brew "grex"
brew "htop"
brew "imagemagick"
brew "nvm"
brew "postgresql"
brew "ranger"
brew "speedtest-cli"
brew "terminal-notifier"
brew "terraform"
brew "the_silver_searcher"
brew "wget"
brew "yarn"
brew "azure/functions/azure-functions-core-tools"
brew "cjbassi/gotop/gotop"
cask "alfred"
cask "amethyst"
cask "appcleaner"
cask "barrier"
cask "bettertouchtool"
cask "dotnet-sdk"
cask "dozer"
cask "dropbox"
cask "figma"
cask "firefox"
cask "font-fira-code"
cask "gimp"
cask "google-chrome"
cask "insomnia"
cask "iterm2"
cask "microsoft-office"
cask "microsoft-teams"
cask "notion"
cask "nuclino"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "slack"
cask "spotify"
cask "spotmenu"
cask "the-unarchiver"
cask "visual-studio-code"
