tap "azure/functions"
tap "clintmod/formulas"
tap "daipeihust/tap"
tap "homebrew/core"
tap "isen-ng/dotnet-sdk-versions"
tap "nikitabobko/tap"

brew "bat"                                              # cat with syntax highlighting and Git integration
brew "node"                                             # JavaScript runtime
brew "bitwarden-cli"                                    # Bitwarden password manager CLI
brew "cloc"                                             # count lines of code
brew "fzf"                                              # fuzzy finder
brew "gh"                                               # GitHub CLI
brew "git"                                              # version control
brew "git-crypt"                                        # transparent git repo encryption
brew "gnupg"                                            # GPG / OpenPGP
brew "go"                                               # Go language
brew "htop"                                             # interactive process viewer
brew "imagemagick"                                      # image manipulation
brew "jenv"                                             # Java version manager
brew "jq"                                               # JSON processor
brew "kubectx"                                          # switch kubectl contexts easily
brew "lsd"                                              # ls with colors and icons
brew "maven"                                            # Java build tool
brew "minikube"                                         # local Kubernetes cluster
brew "nvm"                                              # Node version manager
brew "pinentry-mac"                                     # GPG PIN entry for Mac
brew "pipx"                                             # install Python CLI tools in isolated envs
brew "pnpm"                                             # fast Node package manager
brew "podman"                                           # container engine (Docker alternative)
brew "postgresql"                                       # PostgreSQL 
brew "protobuf"                                         # Protocol Buffers
brew "ranger"                                           # terminal file manager
brew "rbenv"                                            # Ruby version manager
brew "starship"                                         # cross-shell prompt
brew "terminal-notifier"                                # macOS notifications from terminal
brew "terraform"                                        # infrastructure as code
brew "the_silver_searcher"                              # fast code search (ag)
brew "tldr"                                             # simplified man pages
brew "tree"                                             # directory tree view
brew "watch"                                            # run command repeatedly
brew "wget"                                             # file downloader
brew "clintmod/formulas/macprefs"                       # Mac preferences backup/restore

cask "nikitabobko/tap/aerospace"                        # tiling window manager
cask "alt-tab"                                          # Windows-style alt-tab
cask "android-platform-tools"                           # adb and fastboot
cask "appcleaner"                                       # thorough app uninstaller
cask "bambu-studio"                                     # Bambu Lab 3D printer slicer
cask "bettertouchtool"                                  # keyboard/trackpad/gesture customization
cask "bruno"                                            # open-source API client
cask "claude-code"                                      # terminal AI coding assistant
cask "discord"                                          # community chat
cask "figma"                                            # UI/UX design tool
cask "firefox"                                          # browser
cask "font-fira-code"                                   # monospace font with ligatures
cask "font-fira-code-nerd-font"                         # Fira Code with dev icons
cask "gcloud-cli"                                       # Google Cloud SDK
cask "google-chrome"                                    # browser
cask "gpg-suite"                                        # GPG tools for Mac
cask "insomnia"                                         # REST/GraphQL API client
cask "iterm2"                                           # terminal emulator
cask "microsoft-auto-update"                            # keeps Microsoft apps updated
cask "microsoft-office"                                 # Office suite
cask "microsoft-teams"                                  # video meetings and chat
cask "notion"                                           # notes and docs workspace
cask "obsidian"                                         # Markdown knowledge base
cask "podman-desktop"                                   # Podman GUI
cask "powershell"                                       # cross-platform PowerShell
cask "proxyman"                                         # HTTP proxy and network debugger
cask "qlimagesize"                                      # Quick Look: image dimensions
cask "qlmarkdown"                                       # Quick Look: Markdown preview
cask "qlstephen"                                        # Quick Look: plain text files
cask "quicklook-json"                                   # Quick Look: JSON preview
cask "quicklook-video"                                  # Quick Look: video thumbnails
cask "raycast"                                          # Spotlight replacement / launcher
cask "rocket"                                           # emoji picker
cask "setapp"                                           # subscription app platform
cask "slack"                                            # team messaging
cask "spaceid"                                          # menu bar Space indicator
cask "spotify"                                          # music streaming
cask "spotmenu"                                         # Spotify controls in menu bar
cask "syntax-highlight"                                 # Quick Look: code syntax highlighting
cask "tailscale-app"                                    # mesh VPN based on WireGuard
cask "topnotch"                                         # hides macOS notch
cask "visual-studio-code"                               # code editor
cask "vlc"                                              # media player
cask "zen@twilight"                                     # browser

vscode "alefragnani.bookmarks"
vscode "aleksandardev.vscode-sequence-diagrams"
vscode "andrewleedham.vscode-css-modules"
vscode "anthropic.claude-code"
vscode "artdiniz.quitcontrol-vscode"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "azemoh.one-monokai"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "bruno-api-client.bruno"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "cev.overnight"
vscode "christian-kohler.path-intellisense"
vscode "ckolkman.vscode-postgres"
vscode "clinyong.vscode-css-modules"
vscode "csstools.postcss"
vscode "dakara.transformer"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "derivitec-ltd.vscode-dotnet-adapter"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "drblury.protobuf-vsc"
vscode "dsznajder.es7-react-js-snippets"
vscode "dunstontc.viml"
vscode "eamodio.gitlens"
vscode "eliostruyf.vscode-demo-time"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-todo-plus"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "fregante.ghost-text"
vscode "fwcd.kotlin"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hideoo.toggler"
vscode "humao.rest-client"
vscode "irongeek.vscode-env"
vscode "janne252.fontawesome-autocomplete"
vscode "jebbs.plantuml"
vscode "jmrog.vscode-nuget-package-manager"
vscode "kamikillerto.vscode-colorize"
vscode "letrieu.expand-region"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "maptz.camelcasenavigation"
vscode "mathiasfrohlich.kotlin"
vscode "mattpocock.ts-error-translator"
vscode "mike-co.import-sorter"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "paulmolluzzo.convert-css-in-js"
vscode "philsinatra.nested-comments"
vscode "phoenisx.cssvar"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "rogalmic.bash-debug"
vscode "rubbersheep.vscode-plush"
vscode "rust-lang.rust-analyzer"
vscode "ryu1kn.partial-diff"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "swiftlang.swift-vscode"
vscode "tamj0rd2.ts-quickfixes-extension"
vscode "tinkertrain.theme-panda"
vscode "tomaustin.azure-devops-yaml-pipeline-validator"
vscode "tomrijndorp.find-it-faster"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscodevim.vim"
vscode "wallabyjs.quokka-vscode"
vscode "wix.glean"
vscode "wix.vscode-import-cost"
vscode "wrecklessengineer.vscode-instance-rename"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"

go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "graphql_client_cli"
cargo "rustlings"
